# # Классная работа № 2.1 (21.09.2022):

# # Демонстрация работы функции input().
# print('Enter your name:')
# x = input()  # Переменной ч присваиваем значение, введенное пользователем.
# print('Hello, ' + x)

# ## Результат, который передает функция input(), всегда str.
# #anything = input('Enter a number: ')
# #something = anything ** 2.0  # Действие возведения в степень не выполнится, т.к. тип переменной something - str.
# #print(anything, 'to the power of 2 is: ', something)

# # Преобразование переменных в тип int.
# x = int(1)  # Результат - цифра 1.
# y = int(2.8)  # Результат - цифра 2.
# z = int("3")  # Результат - цифра 3.
# print(x, y, z)  # Результат - цифры 1, 2, 3

# # Преобразование переменных в тип float.
# x = float(1)  # Число преобразуется в 1.0.
# y = float(2.8)  # Число уже имееет тип float.
# z = float("3")  # Строка преобразуется в число 3.0.
# w = float("4.2")  # Строка преобразуется в число 4.2.
# print(x)
# print(y)
# print(z)
# print(w)

# # Преобразование переменных в тип str.
# x = str("s1")  # Эта переменная уже имеет тип str.
# y = str(2)  # Число (int) 2 преобразуется в строку 2.
# z = str(3.0)  # Число (float) 3.0 преобразуется в строку 3.0.
# print(x)
# print(y)
# print(z)

# # Пример конкатенации строк.
# fnam = input("May I have your first name, please? ")
# lnam = input("May I have your last name, please? ")
# print("Thank you.")
# print("\nYour name is " + fnam + " " + lnam + ".")  # Сложение строковых переменных и аргументов функции print().

# # Пример репликации строк.
# print("+" + 10 * "-" + "+")  # Вывод +, потом 10 -, потом снова +.
# print(("|" + " " * 10 + "|\n") * 5, end="")  # Вывод |, потом 10 пробелов и снова |. Так 5 раз с новой строки.
# print("+" + 10 * "-" + "+")  # Повторение первой функции print().

# # Пример использования .format.
# a = 100
# print(f'{a = }')  # Вывод сначала строки a = , затем значения переменной.
# print('{} {} {}'.format(a, a + 5, a + 10))  # Вывод последовательно переменной а, затем увеличенного ее значения на 5 и 10.
