# # Классная работа № 2 (22.09.2022). 

# # Результат выполнения операции возведения в степень.
# print(2 ** 3)  # Только в том случае, если обе переменные int, результат будет int.
# print(2 ** 3.)  # Результат float.
# print(2. ** 3)  # Результат float.
# print(2. ** 3.)  # Результат float.

# # Результат выполнения операции умножения.
# print(2 * 3)  # Только в том случае, если обе переменные int, результат будет int.
# print(2 * 3.)  # Результат float.
# print(2. * 3)  # Результат float.
# print(2. * 3.)  # Результат float.

# # Результат выполнения операции деления. Результат float всегда!
# print(6 / 3)  # Результат float.
# print(6 / 3.)  # Результат float.
# print(6. / 3)  # Результат float.
# print(6. / 3.)  # Результат float.

# # Результат выполнения операции целочисленного деления.
# print(6 // 3)  # Результат int.
# print(6 // 3.)  # Результат float.
# print(6. // 3)  # Результат float.
# print(6. // 3.)  # Результат float.
# print(6 // 4)  # Результат int.
# print(6. // 4)  # Результат float.

# # Результат выполнения операции деления по модулю.
# print(14 % 4)  # Результат int.
# print(14 % 4.)  # Результат float.
# print(14. % 4)  # Результат float.
# print(14. % 4.)  # Результат float.

# # Деление на 0.
# # print(3 / 0)

# # Математические операции c разными типами чисел.
# print((2 ** 4), (2 * 4.), (2 * 4))
# print((-2 / 4), (2 / 4), (2 // 4), (-2 // 4))
# print((2 % -4), (2 % 4), (2 ** 3 ** 2))

# # Примеры конкатенации и репликации строк.
# print("abc" + "gca")  # Это конкатенация (сложение).
# print("abc" * 4)  # Это репликация (умножение).

# # Ключевые слова языка Python.
# import keyword  # Импортируем библиотеку.
# print("Ключевые слова языка Python: {} {}".format('\n', keyword.kwlist))  # Выводим ключевые слова.

# # Демонстрация того, что вводимая переменная всегда имеет тип str.
# anything = input("Enter a number: ")
# something = anything ** 2.0  # Пробуем возвести в степень и получаем ошибку, т.к. введенная переменная имеет тип str.
# print(anything, "to the power of 2 is", something)
