# # Классная работа № 3 (23.09.2022):

# # Пример использования логического оператора and:
# i = 0
# x = 0
# while(i < 10 and x < 5):  # Задаем условие выполнения цикла - i < 10 И x < 5.
#     x = i  # Присваиваем переменной x значение переменной i.
#     print(i, end=" ")  # Выводим значение переменной i.
#     i += 1  # Увеличиваем счетчик на 1.


# # Еще один пример использования логического оператора and:
# a = 200
# b = 33
# c = 500
# if a > b and c > a:
#     print("Both conditions are True.")


# # Пример использования логического оператора or:
# a = 200
# b = 33
# c = 500
# if a > b or a > c:  # Задаем условие выполнения.
#     print("At least one of the conditions is True.")


# # Еще один пример использования логического оператора or:
# i = 0
# x = 0
# while(i < 10 or x < 5):  # Задаем условие выполнения цикла - i < 10 ИЛИ x < 5.
#     x = i  # Присваиваем переменной x значение переменной i.
#     print(i, end=" ")  # Выводим значение переменной i.
#     i += 1  # Увеличиваем счетчик на 1.


# # Побитовые операции:
# a = int('00111100', 2)  # Число 60 в двоичном представлении.
# b = int('01001101', 2)  # Число 77 в двоичном представлении.
# print(a)
# print(b)
# print(bin(a & b))  # Результат побитовой конъюнкции (умножения).
# print(bin(a | b))  # Результат побитовой дизъюнкции (сложения).
# print(bin(a ^ b))  # Результат исключающего или.


# # Пример изменения второго бита:
# mask = int('00000000', 2)  # Переменной mask присваиваем двоичное значение 00000000.
# setSecondBit = int('00000010', 2)  # Переменной setSecondBit присваиваем двоичное значение с 1 во втором бите.
# print(bin(mask | setSecondBit))  # Проводим побитовое сложение, выводим результат.


# # Пример операции логического НЕ:
# x = int('00001111', 2)
# print(bin(x))  # Вывод переменной х.
# print(bin(~x))  # Применение операции НЕ к переменной х.


# # Битовые операции сдвига:
# var = 15
# var_right = var >> 1  # Битовая операция сдвига вправо, аналогична целочисленному делению на 2.
# var_left = var << 2  # Битовая операция сдвига влево, аналогична умножению (в примере на 4).
# print(var, bin(var))
# print(var_right, bin(var_right))
# print(var_left, bin(var_left))


# # Примеры логических операций: 
# x = 1
# y = 0

# z = ((x == y) and (x == y)) or not (x == y)  # Результат True.
# print(not(z))  # Результат не True, т.е. False.


# # Пример использования побитовых операций с десятичными числами:
# # Задаем переменные.
# x = 4
# y = 1

# # Задаем побитовые операции.
# a = x & y  # Логическое умножение.
# b = x | y  # Логическое сложение.
# c = ~x  # Логическое отрицание.
# d = x ^ 5  # Логическое исключающее или.
# e = x >> 2  # Битовая операция сдвига вправо, аналогична целочисленному делению на 4.
# f = x << 2  # Битовая операция сдвига влево, аналогична умножению на 4.

# print(a, b, c, d, e, f)
